app/controllers/restaurants_controller.rb

SELECT * FROM "restaurants" WHERE ("restaurants"."id" = 0)
---
  def show
    @restaurant = Restaurant.find(params[:id])